# IsToCover Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..IsToCover Method
RebarConstraint Class See Also
---
Returns true if the RebarConstraintType of the RebarConstraint is 'ToCover.'
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsToCover()
```

Visual Basic
---
```text
Public Function IsToCover As Boolean
```

Visual C++
---
```text
public:
bool IsToCover()
```

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace